In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
df = pd.read_csv("Bengaluru_House_Data.csv")

In [4]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
columns_to_drop = ['area_type', 'availability', 'location', 'society']

In [6]:
df = df.drop(columns = columns_to_drop, errors = "ignore")

In [7]:
df.head()

        size total_sqft  bath  balcony   price
0      2 BHK       1056   2.0      1.0   39.07
1  4 Bedroom       2600   5.0      3.0  120.00
2      3 BHK       1440   2.0      3.0   62.00
3      3 BHK       1521   3.0      1.0   95.00
4      2 BHK       1200   2.0      1.0   51.00

In [8]:
df1 = df.dropna()

Defining a function to remove outliers using z-score

In [41]:
def remove_outliers_zscore(df,columns, threshold=3):
    for column in columns:
        zscores = (df[column])
        df = df[abs(zscores)<=threshold]
    return df

In [ ]:
columns_to_remove_outliers = ['size', 'total_sqft', 'bath', '']

In [42]:
columns_to_remove_outliers = remove_outliers_zscore(df,columns_to_remove_outliers)

NameError: name 'columns_to_remove_outliers' is not defined

In [10]:
df1.shape

(12711, 5)

In [12]:
df1.isnull().sum()

size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [13]:
#coverting the total_sqft's datatype into float
#here we observe that 'total_sqft' contain string value in diff format
#float, int like value 1689.28,817 
# range value: 540 - 740 
# number and string: 142.84Sq. Meter, 117Sq. Yards, 1Grounds
# best strategy is to convert it into number by spliting it

total_sqft_int = []
for str_val in df1['total_sqft']:
    try:
        total_sqft_int.append(float(str_val)) # if '123.4' like this value in str then conver in float
    except:
        try:
            temp = []
            temp = str_val.split('-')
            total_sqft_int.append((float(temp[0])+float(temp[-1]))/2) # '123 - 534' this str value split and take mean
        except:
            total_sqft_int.append(np.nan) # if value not contain in above format then consider as nan

In [14]:
df2 = df1.join(pd.DataFrame({'total_sqft_int':total_sqft_int}))
df2.head()

        size total_sqft  bath  balcony   price  total_sqft_int
0      2 BHK       1056   2.0      1.0   39.07          1056.0
1  4 Bedroom       2600   5.0      3.0  120.00          2600.0
2      3 BHK       1440   2.0      3.0   62.00          1440.0
3      3 BHK       1521   3.0      1.0   95.00          1521.0
4      2 BHK       1200   2.0      1.0   51.00          1200.0

In [15]:
#Changing the size feature to show the numeric values only
size_int = []
for str_val in df2['size']:
    temp=[]
    temp = str_val.split(" ")
    try:
        size_int.append(int(temp[0]))
    except:
        size_int.append(np.nan)

In [16]:
df3 = df2.join(pd.DataFrame({'bhk':size_int}))
df3.shape

(12711, 7)

In [17]:
df3.head()

        size total_sqft  bath  balcony   price  total_sqft_int  bhk
0      2 BHK       1056   2.0      1.0   39.07          1056.0  2.0
1  4 Bedroom       2600   5.0      3.0  120.00          2600.0  4.0
2      3 BHK       1440   2.0      3.0   62.00          1440.0  3.0
3      3 BHK       1521   3.0      1.0   95.00          1521.0  3.0
4      2 BHK       1200   2.0      1.0   51.00          1200.0  2.0

In [21]:
columns_to_drop_df3 = ['size', 'total_sqft']

In [22]:
df4 = df3. drop(columns = columns_to_drop_df3, errors = 'ignore')

In [23]:
df4.head()

   bath  balcony   price  total_sqft_int  bhk
0   2.0      1.0   39.07          1056.0  2.0
1   5.0      3.0  120.00          2600.0  4.0
2   2.0      3.0   62.00          1440.0  3.0
3   3.0      1.0   95.00          1521.0  3.0
4   2.0      1.0   51.00          1200.0  2.0

Defining a function to remove outliers using z-score

In [ ]:
def remove_outliers_zscore(df,columns, threshold=3):
    for column in columns:
        zscores = (df[column])
        df = df[abs(zscores)<=threshold]
    return df

In [30]:
df5=df4.dropna()

In [31]:
y1 = df5['price']
x1 = df5.drop(['price'], axis = 1)

In [32]:
print(y1)

0         39.07
1        120.00
2         62.00
3         95.00
4         51.00
          ...
12706    148.00
12707     56.00
12708    200.00
12709     44.73
12710     45.00
Name: price, Length: 12093, dtype: float64

In [33]:
print(x1)

       bath  balcony  total_sqft_int  bhk
0       2.0      1.0          1056.0  2.0
1       5.0      3.0          2600.0  4.0
2       2.0      3.0          1440.0  3.0
3       3.0      1.0          1521.0  3.0
4       2.0      1.0          1200.0  2.0
...     ...      ...             ...  ...
12706   3.0      2.0          1715.0  3.0
12707   3.0      2.0          3453.0  5.0
12708   3.0      2.0          1141.0  2.0
12709   2.0      2.0          4689.0  4.0
12710   2.0      1.0           550.0  1.0

[12093 rows x 4 columns]

In [34]:
from sklearn.model_selection import train_test_split
X1_train, X1_test, y1_train, y1_test = train_test_split(
    x1, y1, test_size=0.35, random_state=100
)

In [36]:
#Fitting the Multiple Linear Regression model
from sklearn.linear_model import LinearRegression
mlr = LinearRegression()  
mlr.fit(X1_train, y1_train)

LinearRegression()

In [38]:
print("Intercept: ", mlr.intercept_)
print("Coefficients:")
list(zip(x1, mlr.coef_))

Intercept:  -32.069965842865486
Coefficients:

[('bath', 51.728269896312554),
 ('balcony', 3.4427662058719672),
 ('total_sqft_int', -0.00045766993573834283),
 ('bhk', -0.8544575279714219)]

In [39]:
#Prediction of test set
y_pred_mlr = mlr.predict(X1_test)
#Predicted values
print("Prediction for test set: {}".format(y_pred_mlr))

Prediction for test set: [ 69.12845497  78.56476713  72.68563866 ...  73.08447885 179.47052718
  72.61698817]

In [40]:
#Actual value and the predicted value
mlr_diff = pd.DataFrame({'Actual value': y1_test, 'Predicted value': y_pred_mlr})
mlr_diff.head()

      Actual value  Predicted value
9685         65.00        69.128455
116          64.00        78.564767
5105         55.00        72.685639
5745         61.33        76.288589
1548         42.00        72.589528